In [85]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.preprocessing import StandardScaler

In [86]:
df_train=pd.read_csv('titanic_train.csv')
df_test=pd.read_csv('titanic_test.csv')

y_train=np.asarray(df_train['Survived'].astype('int64'))
df_train

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [87]:
def preprocessing(df):
  df=df.fillna(0)
  df=df.drop(['PassengerId'],1)
  #df=df.drop(['SibSp'],1)
  df=df.drop(['Name'],1)
  df=df.drop(['Ticket'],1)
  df.drop('Cabin', inplace=True, axis=1)
  df.replace(to_replace ="male", 
                 value = "1",inplace = True)
  df.replace(to_replace ="female", 
                 value = "0",inplace = True)
  df.replace(to_replace ="Q", 
                 value = "0",inplace = True)
  df.replace(to_replace ="S", 
                 value = "1",inplace = True)
  df.replace(to_replace ="C", 
                 value = "2",inplace = True)

  return df

In [88]:

X_train=preprocessing(df_train)
Y_train = X_train["Survived"]
X_train=X_train.drop(['Survived'], 1)



X_train

     Pclass Sex   Age  SibSp  Parch     Fare Embarked
0         3   1  22.0      1      0   7.2500        1
1         1   0  38.0      1      0  71.2833        2
2         3   0  26.0      0      0   7.9250        1
3         1   0  35.0      1      0  53.1000        1
4         3   1  35.0      0      0   8.0500        1
..      ...  ..   ...    ...    ...      ...      ...
886       2   1  27.0      0      0  13.0000        1
887       1   0  19.0      0      0  30.0000        1
888       3   0   0.0      1      2  23.4500        1
889       1   1  26.0      0      0  30.0000        2
890       3   1  32.0      0      0   7.7500        0

[891 rows x 7 columns]

In [89]:
X_train.fillna(method='ffill',inplace=True)
X_train.Sex = X_train.Sex.astype('float')
X_train.Embarked = X_train.Embarked.astype('float')
X_train

PassengerId = df_test["PassengerId"]
X_test = preprocessing(df_test)

In [90]:
X_test

     Pclass Sex   Age  SibSp  Parch      Fare Embarked
0         3   1  34.5      0      0    7.8292        0
1         3   0  47.0      1      0    7.0000        1
2         2   1  62.0      0      0    9.6875        0
3         3   1  27.0      0      0    8.6625        1
4         3   0  22.0      1      1   12.2875        1
..      ...  ..   ...    ...    ...       ...      ...
413       3   1   0.0      0      0    8.0500        1
414       1   0  39.0      0      0  108.9000        2
415       3   1  38.5      0      0    7.2500        1
416       3   1   0.0      0      0    8.0500        1
417       3   1   0.0      1      1   22.3583        2

[418 rows x 7 columns]

In [91]:
def fit(X,Y):
    trans=np.transpose(X)
    product=trans.dot(X)
    inv=np.linalg.inv(product)
    inverted=inv.dot(trans)
    result=inverted.dot(Y)
    return result

In [92]:
X_train = X_train.astype(float)
Y_train = Y_train.astype(float)
fit_result = fit(X_train,Y_train)
fit_result

array([ 0.10855206, -0.43990094,  0.00299701, -0.0311817 , -0.01526637,
        0.00262099,  0.2260267 ])

In [93]:
#predict
X_test = X_test.astype(float)
pred = X_test.dot(fit_result)
pred[pred >= 0.5] = 1
pred[pred < 0.5] = 0
pred

0      0.0
1      1.0
2      0.0
3      0.0
4      1.0
      ...
413    0.0
414    1.0
415    0.0
416    0.0
417    0.0
Length: 418, dtype: float64

In [94]:
def RegressionSquared(Y,Y1):
  num = np.sum((Y-Y1)**2)
  y_mean = np.mean(Y)
  denom = np.sum((Y-y_mean)**2)
  return (1-(num/denom))

In [95]:
RegressionSquared(Y_train,pred)

0.07937877480586697

In [96]:
existPred = pd.read_csv('titanic_test_prediction.csv')
existPred=existPred.Survived
RegressionSquared(existPred,pred)

0.5554511278195489